{"keras_version": "2.2.2", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_4", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "sparse": false, "dtype": "float32", "name": "input_6"}, "inbound_nodes": []}, {"name": "sequential_3", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dtype": "float32", "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "strides": [2, 2], "kernel_size": [3, 3], "name": "conv2d_8", "dilation_rate": [1, 1], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "noise_shape": null, "rate": 0.25, "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [2, 2], "name": "conv2d_9", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "noise_shape": null, "rate": 0.25, "seed": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_6", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [2, 2], "name": "conv2d_10", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "noise_shape": null, "rate": 0.25, "seed": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_7", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [2, 2], "name": "conv2d_11", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "noise_shape": null, "rate": 0.25, "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "data_format": "channels_last", "trainable": true}}], "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense_4", "units": 1, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}, "inbound_nodes": [[["sequential_3", 1, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense_5", "units": 10, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}, "inbound_nodes": [[["sequential_3", 1, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["dense_4", 0, 0], ["dense_5", 0, 0]]}}