{"keras_version": "2.2.2", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_5", "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "sparse": false, "dtype": "int32", "name": "input_8"}, "inbound_nodes": []}, {"name": "embedding_2", "class_name": "Embedding", "config": {"activity_regularizer": null, "dtype": "float32", "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "mask_zero": false, "trainable": true, "batch_input_shape": [null, null], "name": "embedding_2", "output_dim": 100, "embeddings_regularizer": null, "input_dim": 10, "input_length": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "sparse": false, "dtype": "float32", "name": "input_7"}, "inbound_nodes": []}, {"name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "multiply_2", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true}, "inbound_nodes": [[["input_7", 0, 0, {}], ["flatten_4", 0, 0, {}]]]}, {"name": "sequential_4", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "batch_input_shape": [null, 100], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 6272, "name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu"}}, {"class_name": "Reshape", "config": {"name": "reshape_2", "target_shape": [7, 7, 128], "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_8", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "name": "conv2d_12", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_9", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "name": "conv2d_13", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_10", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "name": "conv2d_14", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "tanh", "trainable": true}}], "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0], ["input_8", 0, 0]], "output_layers": [["sequential_4", 1, 0]]}}